import React from "react";
import Modal from "react-bootstrap/Modal";
import { useNavigate, useSearchParams } from "react-router-dom";

const GeneralTerms = () => {
    const navigate = useNavigate();
    const [searchParams] = useSearchParams();
    const next = `${searchParams.get("next") ? searchParams.get("next") : "/"}`;
    return (
        <Modal
            show={true}
            onHide={() => {
                navigate(next);
            }}
            onEscapeKeyDown={() => {
                navigate(next);
            }}
            // dialogClassName="modal-90w"
            size="lg"
            aria-labelledby="delivery"
            scrollable
        >
            <Modal.Header closeButton>
                <Modal.Title id="delivery">Общи условия</Modal.Title>
            </Modal.Header>
            <Modal.Body>
                <ol>
                    <li>
                        <strong> ПРЕДМЕТ</strong>
                    </li>
                </ol>
                <p>
                    <strong>Чл. 1.&nbsp;</strong>Настоящите общи условия, наричани по-долу за краткост „
                    <strong>Общи условия</strong>“, са предназначени за регулиране на отношенията между ...,
                    наричано по-долу за краткост „<strong>Доставчик</strong>“, собственик на интернет
                    страницата:&nbsp;<a href="https://mravolak.mine.bz/">Mravolak</a>, наричана по-долу за
                    краткост „<strong>Интернет страница</strong>“, и всеки един от ползвателите, наричани
                    по-долу за краткост „<strong>Ползвател/и</strong>“, на Интернет страницата, във връзка с
                    използването от Ползвателя на Интернет страницата.
                </p>
                <p>&nbsp;</p>
                <ol>
                    <li>
                        <strong> ДАННИ ЗА ДОСТАВЧИКА</strong>
                    </li>
                </ol>
                <p>
                    <strong>Чл. 2.&nbsp;</strong>Информация относно Доставчика:
                </p>
                <ol>
                    <li>Наименование: </li>
                    <li>Адрес: </li>
                    <li>ЕИК: </li>
                    <li>
                        Вписване в публични регистри: Търговски регистър при Агенция по вписванията към
                        Министерство на правосъдието на Република България.
                    </li>
                    <li>Надзорни органи:</li>
                </ol>
                <p>
                    <strong>(а)&nbsp;</strong>Комисия за защита на личните данни на Република България, адрес:
                    гр. София, п.к. 1592, бул. „Проф. Цветан Лазаров“ № 2, тел.: 02/ 915 35 18 факс: 02/ 915
                    35 25, Имейл: kzld@cpdp.bg, Интернет сайт: www.cpdp.bg
                </p>
                <p>
                    <strong>(б)&nbsp;</strong>Комисия за защита на конкуренцията, адрес: гр.София, п.к. 1000,
                    бул.“Витоша“ № 18, тел.: 02/ 935 62 22, факс: 02/ 980 73 15, Имейл: cpcadmin@cpc.bg,
                    Интернет сайт: www.cpc.bg
                </p>
                <p>&nbsp;</p>
                <p>
                    <strong>III. ОБЩИ РАЗПОРЕДБИ</strong>
                </p>
                <p>
                    <strong>Чл. 3.</strong>&nbsp;Интернет страницата и услугите, предлагани чрез нея,
                    функционират при правилата описани в Общите условия.
                </p>
                <p>
                    <strong>Чл. 4.</strong>&nbsp;Доставчикът не гарантира постоянното функциониране на
                    Интернет страницата, нито че последната не съдържа грешки.
                </p>
                <p>
                    <strong>Чл. 5.&nbsp;</strong>Доставчикът си запазва правото да прекъсва достъпа до
                    определен материал (включително, но не само: снимки, текстове и други), публикуван на
                    Интернет страницата или до цялата Интернет страница, без съгласието на Ползвателя, за
                    неограничен период от време, планирано или инцидентно, без да носи отговорност за
                    евентуално настъпили в следствие на спирането вреди за Ползвателя.
                </p>
                <p>
                    <strong>Чл. 6.</strong>&nbsp;Доставчикът си запазва правото да променя, без предварително
                    уведомление, структурата или съдържанието на Интернет страницата. Промените влизат в сила
                    незабавно след публикуването им на Интернет страницата.
                </p>
                <p>&nbsp;</p>
                <ol>
                    <li>
                        <strong> ХАРАКТЕРИСТИКИ НА УСЛУГАТА</strong>
                    </li>
                </ol>
                <p>
                    <strong>Чл. 7.</strong>&nbsp;Основните характеристики на услугите, предоставяни на
                    Ползвателите от Доставчика чрез Интернет страницата, наричани по-долу за краткост „
                    <strong>Услуги</strong>“, са следните:
                </p>
                <p>
                    <strong>(1)</strong>&nbsp;Доставчикът предоставя възможност за разглеждане и споделяне на
                    съдържанието, публикувано на Интернет страницата. Доставчикът предоставя информация за
                    себе си, екипа си, предоставяните от него услуги, актуални предложения, информационни
                    статии, контакти, представяне на свои клиенти и партньори и други.
                </p>
                <p>
                    <strong>(2)</strong>&nbsp;Доставчикът предоставя възможност за търсене на текстово
                    съдържание в рамките на Интернет страницата. За да използва функцията, Ползвателят следва
                    да изпише в полето за търсене търсената от него дума /думи и да избере бутона / иконката
                    за търсене или клавиш на клавиатурата Enter / Go. Интернет страницата ще изкара списък от
                    резултати със страници / продукти намиращи се на Интернет страницата и съдържащи търсената
                    от Ползвателя дума / думи.
                </p>
                <p>
                    <strong>(3)</strong>&nbsp;Доставчикът предоставя възможност за генериране на телефонно
                    обаждане чрез функционални бутони в Интернет страницата. При използване на тази услуга
                    Ползвателите следва да имат предвид и с приемането на настоящите Общи условия да се считат
                    за информирани, че Доставчикът може да записва телефонните разговори (както входящи, така
                    и изходящи обаждания) между неговите служители и/или представители и служителите и/или
                    представителите на съответния Ползвател.
                </p>
                <p>
                    <strong>(4)</strong>&nbsp;Доставчикът предоставя възможност за генериране на електронни
                    запитвания по имейл адрес (електронна поща) чрез функционални форми за запитване в рамките
                    на Интернет страницата. Ползвателят следва да попълни посочените от Доставчика полета и да
                    избере бутон Изпрати / Изпращане. При използване на тази услуга Ползвателите следва да
                    имат предвид и с приемането на настоящите Общи условия да се считат за информирани, че
                    използването на тази услуга не води автоматично до сключване на договор между съответния
                    Ползвател и Доставчика, т.е. изпращането на запитване по имейл не създава задължение за
                    Доставчика за предоставяне на определена услуга (например: изработване на интернет
                    страница) и не поставя Доставчика и Ползвателя в договорни (облигационни) отношения.
                    Следва да се счита, че съответният Ползвател, отправил запитване по имейл до Доставчика, е
                    сключил договор с Доставчика за извършване на дадената услуга едва след получаване на
                    потвърждение в тази връзка от страна на Доставчика.
                </p>
                <p>
                    Доставчикът не гарантира възможността си за отговор и срока, в който ще бъде предоставен
                    такъв.
                </p>
                <p>
                    <strong>(5)</strong>&nbsp;Доставчикът предоставя възможност за генериране на електронни
                    запитвания, чрез използван от Ползвателя имейл клиент, посредством функционални препратки
                    от Интернет страницата. За целта е необходимо Ползвателят да избере конкретна функционална
                    препратка на Интернет страницата (
                    <em>
                        място, на което е изписан имейл адрес на Доставчика и върху него може да се „кликне“
                    </em>
                    ) и ползваното от него устройство да отвори нов прозорец за писане на съобщение от имейл
                    клиент заложен на устройството.
                </p>
                <p>
                    Доставчикът не гарантира възможността си за отговор и срока, в който ще бъде предоставен
                    такъв.
                </p>
                <p>
                    <strong>(6)</strong>&nbsp;Доставчикът предоставя възможност за препращане (линкинг) на
                    Ползвателя към бизнес профили на Доставчика в социалните мрежи, профили и интернет
                    страници на негови партньори, клиенти и други. Доставчикът предоставя тази възможност с
                    цел улеснение на Ползвателите, като не носи отговорност за съдържанието на профилите и
                    интернет страниците, към които е предоставена възможност за препращане и които не са
                    собственост на и/или не са оперирани от Доставчика. Настоящите Общи условия не се прилагат
                    по отношение на профилите и страниците, към които е предоставена възможност за препращане,
                    освен ако изрично не е посочено друго.
                </p>
                <p>
                    <strong>(7)</strong>&nbsp;Доставчикът предоставя възможност за ползване на динамична
                    Google карта, интегрирана на Интернет страницата. Използването на тази услуга става в
                    съответствие с приложимите условия за ползване на Google Maps and Google Earth налични
                    на:&nbsp;
                    <a href="https://www.google.com/intl/bg_bg/help/terms_maps.html">
                        https://www.google.com/intl/bg_bg/help/terms_maps.html
                    </a>
                    .
                </p>
                <p>
                    <strong>(8)</strong>&nbsp;Услугите, поместени на и/ или предоставяни чрез Интернет
                    страницата са предназначени единствено за бизнес клиенти (например: търговци и физически
                    лица, действащи в рамките на своята търговска или професионална дейност) и не изискват
                    онлайн регистрация на Интернет страницата. С оглед на горното за Ползватели на Интернет
                    страницата не следва да се приемат лица, които са потребители по смисъла на § 13, т. 1 от
                    Закона за защита на потребителите.
                </p>
                <p>
                    <strong>(9)</strong>&nbsp;Всички услуги, представяни посредством Интернет страницата и
                    посочени в предходните алинеи на настоящия член са безплатни. От друга страна, всички цени
                    на платените услуги, предоставяни от Доставчика (например: изработка на интернет страница
                    и други), и посочени на Интернет страницата са без включен данък добавена стойност
                    („ДДС“).
                </p>
                <p>&nbsp;</p>
                <ol>
                    <li>
                        <strong> ПРАВА ВЪРХУ ИНТЕЛЕКТУАЛНА СОБСТВЕНОСТ</strong>
                    </li>
                </ol>
                <p>
                    <strong>Чл. 8. (1)</strong>&nbsp;Цялата информация, публикувана на Интернет страницата,
                    включително, но не само: текстове, снимки, аудио и видео материали, е интелектуална
                    собственост на Доставчика или се ползва от последния на законово основание и като такава
                    се закриля от действащото законодателство относно защитата на интелектуалната собственост,
                    включително но не само защитата на авторското и сродните му права.
                </p>
                <p>
                    <strong>(2)</strong>&nbsp;Доставчикът си запазва всички права посочени в предходната
                    алинея.
                </p>
                <p>
                    <strong>(3)</strong>&nbsp;Използването на информацията, посочена в ал. 1 на настоящия
                    член, включително, но не само: копиране, промяна, възпроизвеждане, без съгласието и
                    позволението на Доставчика или на съответния носител на правата върху интелектуална
                    собственост, освен в изрично посочените в закона случаи, е забранено и представлява
                    нарушение на правата на Доставчика върху интелектуална собственост или на тези на
                    съответния им носител, в случай че той е различен от Доставчика.
                </p>
                <p>
                    <strong>Чл. 9.</strong>&nbsp;Интернет страницата може да съдържа имена и марки на
                    продукти, услуги или лица, които представляват или могат да представляват търговски марки,
                    собственост на Доставчика или на трети лица. Достъпът до Интернет страницата, както и нищо
                    в настоящите Общи условия или останалото съдържание на Интернет страницата не трябва да се
                    разбира и/или да се тълкува като и не представлява предоставяне на лиценз или на право за
                    използване на която и да е такава търговска марка, без предварителното писмено съгласие на
                    Доставчика или на съответното трето лице – собственик на въпросния обект на интелектуална
                    собственост.
                </p>
                <p>
                    <strong>&nbsp;</strong>
                </p>
                <ol>
                    <li>
                        <strong> ПРЕПРАЩАНЕ КЪМ ЧУЖДА ИНФОРМАЦИЯ</strong>
                    </li>
                </ol>
                <p>
                    <strong>Чл. 10. (1)</strong>&nbsp;Както е посочено в чл. 7, ал. 6 от настоящите Общи
                    условия Доставчикът не носи отговорност за съдържанието на профилите и интернет
                    страниците, собственост на и/или оперирани от трети лица, към които предоставя възможност
                    за препращане (линкинг).
                </p>
                <p>
                    <strong>(2)</strong>&nbsp;В случай че даден Ползвател счита, че даден профил и/или
                    интернет страница, към която Интернет страницата предоставя възможност за препраща,
                    съдържа противоправна информация, включително такава, която нарушава негови права върху
                    интелектуална собственост, този Ползвател следва да информира Доставчика за това,
                    следвайки следната процедура:
                </p>
                <ol>
                    <li>
                        <strong>a)</strong>Ползвателят трябва да изпрати претенцията си за противоправно
                        съдържание, включително за такова, което нарушава негови права върху интелектуална
                        собственост, на следния имейл адрес:&nbsp;<u>office</u>
                        <u>@megdani.online</u>;
                    </li>
                    <li>
                        <strong>b)</strong>Заедно с претенцията си по предходната буква Ползвателят трябва да
                        изпрати и доказателства за противоправността на съдържанието, включително за
                        нарушаването на права върху интелектуална собственост (включително, но не само:
                        доказателства, че именно Ползвателят е носител на правата върху интелектуална
                        собственост, чието нарушение се твърди).
                    </li>
                </ol>
                <p>
                    <strong>(3)</strong>&nbsp;В срок до 10 (десет) работни дни, считано от получаване на
                    информацията по ал. 2 по-горе, Доставчикът ще информира (освен ако това не му коства
                    изключително много усилия, средства и ресурси) третото лице, собственик и/или оператор на
                    профила и/или на интернет страницата (на база на наличната на Доставчика информация, без
                    последният да прави изрично проучване за собствеността на въпросния профил и/или интернет
                    страница или пък да носи отговорност в тази връзка) за постъпилата претенция, като
                    предостави на това трето лице срок от 10 (десет) работни дни, в който да изрази своето
                    становище и предостави съответни доказателства във връзка с постъпилата претенция, на
                    следния имейл адрес:&nbsp;<u>office</u>
                    <u>@megdani.online</u>. В случай че собственикът и операторът на съответния профил или
                    интернет страница са различни лица, изпращането от страна на Доставчика на съобщение по
                    смисъла на настоящата алинея до само едно от тези лица (по преценка на Доставчика) ще се
                    счита за достатъчно.
                </p>
                <p>
                    <strong>(4)</strong>&nbsp;В случай че третото лице по смисъла на ал. 3 по-горе, в срока по
                    същата алинея, се съгласи с претенцията по чл. 2 на настоящия член или не възрази срещу
                    последната (например: не изпрати никакво становище или отговор), Доставчикът ще
                    преустанови, без излишно забавяне, предоставянето на достъп до въпросния профил, интернет
                    страница или конкретна информация, съдържаща се в тях, посредством електронна препратка на
                    Интернет страницата.
                </p>
                <p>
                    <strong>(5)</strong>&nbsp;В случай че третото лице по смисъла на ал. 3 по-горе, в срока по
                    същата алинея, възрази срещу претенцията по чл. 2 на настоящия член, Доставчикът ще
                    ограничи временно, без излишно забавяне, предоставянето на достъп до въпросния профил,
                    интернет страница или конкретна информация, съдържаща се в тях, посредством електронна
                    препратка на Интернет страницата, до изясняване на така създалата се ситуация между
                    замесените лица чрез предоставяне на Доставчика, от което и да е от тези лица, на надлежно
                    издаден акт (например: съдебно решение, арбитражно решение, извънсъдебно споразумение и
                    други), потвърждаващ/ подкрепящ една от двете позиции.
                </p>
                <p>
                    <strong>(6)</strong>&nbsp;При следване на процедурата по предходните алинеи на настоящия
                    член, Доставчикът не носи отговорност за вреди, претърпени, от която и да е от замесените
                    страни, в резултат от действия и/или бездействия на една от страните по спора. Доставчикът
                    не е институция, инстанция или пък орган, компетентен да разглежда правни спорове и
                    съответно не може да се произнася по валидността и/или основателността на дадена
                    претенция, с акт, който да е окончателен и/или обвързващ страните по претенцията.
                </p>
                <p>&nbsp;</p>
                <p>
                    <strong>VII. ДРУГИ УСЛОВИЯ</strong>
                </p>
                <p>
                    <strong>Чл. 11. (1)</strong>&nbsp;Информацията и материалите, достъпни на Интернет
                    страницата (включително, но не само: статии, изображения, съобщения и други) са с
                    информативен, общ и абстрактен характер и не представляват, нито следва да се приемат или
                    пък да се тълкуват като съвет, насоки и/ или консултация, предоставени от Доставчика на
                    който и да е от Ползвателите на Интернет страницата.
                </p>
                <p>
                    <strong>(2)</strong>&nbsp;Доставчикът не носи отговорност за коректността, надеждността,
                    верността и/или актуалността на информацията и материалите, достъпни на и/или посредством
                    Интернет страницата, по какъвто и да е повод, нито за приложимостта им към конкретна
                    фактическа обстановка.
                </p>
                <p>
                    <strong>(3)</strong>&nbsp;Доставчикът не носи имуществена и/или неимуществена отговорност
                    за съдържанието на Интернет страницата, нито отговаря за вреди, претърпени от който и да е
                    Ползвател и/или от трето лице във връзка с използването на Интернет страницата и/или на
                    достъпните на нея информация и материали, включително прилагането им към конкретна
                    ситуация (например: предприемане от Ползвател на конкретни действия на база на информация,
                    поместена на Интернет страницата).
                </p>
                <p>
                    <strong>Чл. 12.</strong>&nbsp;Евентуалната недействителност на някоя от разпоредбите на
                    Общите условия няма да води до недействителност на целия договор.
                </p>
                <p>
                    <strong>Чл. 13.</strong>&nbsp;Настоящите Общи условия влизат в сила за всички Ползватели,
                    считано от 01.09.2018 г.
                </p>
                <p>
                    <strong>Чл. 14.</strong>&nbsp;Общите условия могат да бъдат изменяни от Доставчика по
                    всяко време, като всяка промяна в Общите условия влиза в сила спрямо Ползвателите без да е
                    необходимо изрично уведомяване на последните.
                </p>
                <p>
                    <strong>Чл. 15.</strong>&nbsp;С използването (включително, но не само: разглеждане,
                    кликване на линкове, въвеждане на информация и други) на Интернет страницата и
                    информацията в нея, Ползвателят изразява безусловното си съгласие с Общите условия и
                    всички последващи промени в тях, както и че е обвързан от тях и ще ги спазва.
                </p>
            </Modal.Body>
        </Modal>
    );
};

export default GeneralTerms;
