import React, { useContext } from "react";
import Modal from "react-bootstrap/Modal";
import { useNavigate, useSearchParams } from "react-router-dom";
import CTX from "../../utils/context";

const PrivacyPolicy = () => {
    const { context } = useContext(CTX);
    const navigate = useNavigate();
    const [searchParams] = useSearchParams();
    const next = `${searchParams.get("next") ? searchParams.get("next") : "/"}`;
    return (
        <Modal
            show={true}
            onHide={() => {
                navigate(next);
            }}
            onEscapeKeyDown={() => {
                navigate(next);
            }}
            // dialogClassName="modal-90w"
            size="lg"
            aria-labelledby="delivery"
            scrollable
        >
            <Modal.Header closeButton>
                <Modal.Title id="delivery">Доставка и плащане</Modal.Title>
            </Modal.Header>
            <Modal.Body>
                <h3>Политика за личните данни на електронния сайт и услугите на Mravolak</h3>
                <p></p>
                <ul>
                    <li>ПРЕДМЕТ</li>
                </ul>
                <p>
                    <strong>Чл. 1. </strong>Настоящата Политика за личните данни, наричана по-долу за краткост
                    „<strong>Политика за личните данни</strong>“, е предназначена за регулиране на отношенията
                    при обработката на лични данни между Mravolak, наричано по-долу за краткост „
                    <strong>Доставчик</strong>“, собственик на интернет страницата{" "}
                    <a href="https://mravolak.mine.bz/">mravolak.mine.bz</a>, наричана по-долу за краткост „
                    <strong>Интернет страница</strong>“, и всеки един от ползвателите ѝ, наричани по-долу за
                    краткост „<strong>Ползвател</strong>“, на Интернет страницата, във връзка с използването
                    от Ползвателя на Интернет страницата.
                </p>
                <p></p>
                <ul>
                    <li>ДАННИ ЗА ДОСТАВЧИКА</li>
                </ul>
                <p>
                    <strong>Чл. 2. </strong>Информация относно Доставчика:
                </p>
                <ol>
                    <li>Наименование: </li>
                    <li>Адрес: </li>
                    <li>ЕИК: </li>
                    <li>
                        Вписване в публични регистри: Търговски регистър при Агенция по вписванията към
                        Министерство на правосъдието на Република България.
                    </li>
                    <li>Надзорни органи:</li>
                </ol>
                <p>
                    Комисия за защита на личните данни на Република България, адрес: гр. София, п.к. 1592,
                    бул. „Проф. Цветан Лазаров“ № 2, тел.: 02/ 915 35 18 факс: 02/ 915 35 25, Имейл:
                    kzld@cpdp.bg, Интернет сайт: <a href="http://www.cpdp.bg">www.cpdp.bg</a>
                </p>
                <ul>
                    <li>ЗАЩИТА НА ЛИЧНИТЕ ДАННИ</li>
                </ul>
                <p>
                    <strong>Чл. 3. (1) </strong>Доставчикът, чрез Интернет страницата, събира, съхранява и
                    обработва лични данни на Ползвателите само във връзка със своята дейност, съобразено с
                    изискванията на приложимото право и със Закона за защита на личните данни на Република
                    България.
                </p>
                <p>
                    <strong>(2) </strong>Личните данни на Ползвателя могат да бъдат ползвани за удостоверяване
                    и извършване на комуникация при направени запитвания или генерирани кандидатури за работа,
                    предоставяне на рекламно съдържание адаптирано спрямо интересите на Ползвателя, изпращане
                    на Бюлетин в случай, че Ползвателя е предоставил съгласието си за получаване на такъв,
                    статистически информация за ползване на Интернет страницата, защита на информационната
                    сигурност на Интернет страницата, счетоводни цели във връзка с ползване услугите на
                    Доставчика, Обезпечаване предоставянето на услугите на Доставчика.
                </p>
                <p>
                    <strong>(3) </strong>Доставчикът не ползва и не обработва лични данни на Ползвателя, които
                    дават информация за расов или етнически произход, които са свързани със здравето,
                    сексуалния живот, човешкия геном на Ползвателя, които са свързани с политически,
                    религиозни, философски убеждения или участия.
                </p>
                <p>
                    <strong>(4) </strong>Доставчикът е регистриран администратор на лични данни съгласно
                    Закона за защита на личните данни в Комисията за защита на лични данни с рег.№ ………………..
                </p>
                <p>
                    <strong>(5) </strong>Доставчикът предприема мерки за защита на личните данни на Ползвателя
                    съгласно действащото законодателство в Република България, включително Закона за защита на
                    личните данни.
                </p>
                <p>
                    <strong>Чл. 4. </strong>Интернет страницата използва бисквитки (cookies), като вида,
                    целите и условията за използването им са посочени в Политиката за бисквитки, достъпна
                    по-долу, с която чрез използването на Интернет страницата Ползвателят се съгласява.
                </p>
                <p>
                    <strong>Чл. 5. </strong>С използването на Интернет страницата Получателят се съгласява
                    изрично, че Доставчикът има право да обработва личните му данни съгласно настоящите Общи
                    условия достъпни{" "}
                    <a
                        href={`${window.location.protocol}//${window.location.host}/#/general_terms/?lang=${context.lang}`}
                    >
                        тук
                    </a>
                    .
                </p>
                <p>
                    <strong>Чл. 6.</strong> Доставчикът не разкрива, продава, обменя или по какъвто и да било
                    друг начин предоставя на трети страни информацията, която Интернет страницата събира през
                    посещенията на Ползвателя, освен когато това се изисква съгласно приложимото
                    законодателство и/или от надлежен орган, упълномощен по закон, но винаги при спазване на
                    действащото законодателство в Република България.
                </p>
                <p>
                    <strong>Чл. 7. </strong>Ползвателят може да иска от Доставчика да коригира, изтрие,
                    ограничи ползването на личните му данни чрез изпращане на електронно съобщение към
                    Доставчика, с ясно изразено желание, към{" "}
                    <a href="mailto:mravolak@gmail.com">mravolak@gmail.com</a>;
                </p>
                <ul>
                    <li>ПОЛИТИКА ЗА БИСКВИТКИТЕ</li>
                </ul>
                <p>
                    <strong>Какво представляват бисквитките</strong>
                </p>
                <p>
                    Бисквитките са малки текстови файлове, които се запазват на Вашия компютър или мобилно
                    устройство, когато посещавате нашия уеб сайт. Те позволяват на уеб сайта да запаметява
                    Вашите действия и предпочитания, за определен период от време, за да не се налага да ги
                    въвеждате всеки път, когато посещавате сайта или преминавате от една страница към друга.
                </p>
                <p>Как и защо ползваме „бисквитки“ на нашия уеб сайт</p>
                <p>
                    В Mravolak ние използваме минимално HTTP-бисквитки (HTTP cookies), или просто бисквитки,
                    изброени по- долу. С използването на сайта Вие се съгласявате с това.
                </p>
                {/* <p>
                    <em>Функционални бисквитки</em>
                </p>
                <p>
                    Използваме бисквитки, които позволяват на уеб сайта да запаметява Вашите действия и
                    предпочитания (като например потребителско име, език, възраст, размер на шрифта и други
                    настройки за показване) за определен период от време, за да не се налага да ги въвеждате
                    всеки път, когато посещавате сайта или преминавате от една страница към друга.
                </p> */}
                <p>
                    <em>Бисквитки за сигурност</em>
                </p>
                <p>
                    Използваме бисквитки от гледна точка на сигурност, чиято цел е да предотвратяват
                    измамническо използване на идентификационни данни за вход, както и за защита информацията
                    от неупълномощени страни.
                </p>
                <p>
                    <em>Анализиращи бисквитки</em>
                </p>
                <p>
                    Използваме Анализиращи бисквитки, които ни помагат да подобрим работа и ефективността на
                    интернет страницата си като чрез тях събираме информация относно броя на уникалните
                    посещения, статистически данни за употребата на интернет страницата, най-разглеждани,
                    скоро разглеждани страници.
                </p>
                <p>
                    <em>Бисквитки на трети страни</em>
                </p>
                <p>
                    Използваме бисквитки на трети страни, които позволяват харесване или споделяне на
                    съдържание в Социалните мрежи, бисквитки от Google Analytics, които помагат за
                    проследяване трафика на уеб сайта и други бисквитки свързани с външни системи и сайтове
                    интегрирани към уеб сайта.
                </p>
                {/* <p>
                    <em>Рекламни бисквитки</em>
                </p>
                <p>
                    Използваме бисквитки, които на база Вашето поведение в нашия уеб сайт може да Ви показват
                    реклами, които предполагаме, че отговарят на Вашите предпочитания и интереси.
                </p> */}
                <p> </p>
                <p>
                    <strong>ЛИЧНИ ДАННИ ОТ БИСКВИТКИТЕ</strong>
                </p>
                <p>
                    Личните данни събрани от бисвкитките се използват единствено и само за осъществяването на
                    конкретни функции в сайта, свързани със самия потребител.
                </p>
                <p> </p>
                <p>
                    <strong>КАК ДА УПРАВЛЯВАТЕ БИСКВИТКИТЕ</strong>
                </p>
                <p>
                    Повечето стандартни браузъри дават възможност да променяте настройките за „бисквитки“.
                    Обикновено можете да намерите тези настройки в меню „опции“ или „предпочитания“ на вашия
                    браузър. Повече информация относно това как да управлявате бисквитки (включително да как
                    да ги изтриете) според вида на браузъра, който ползвате, може да намерите на следните
                    линкове:
                </p>
                <ul>
                    <li>
                        Internet Explorer –&nbsp;
                        <a href="https://support.microsoft.com/en-us/help/17442/windows-internet-explorer-delete-manage-cookies#ie=ie-10">
                            https://support.microsoft.com/en-us/help/17442/windows-internet-explorer-delete-manage-cookies#ie=ie-10
                        </a>
                    </li>
                    <li>
                        Firefox –&nbsp;
                        <a href="https://support.mozilla.org/t5/How-To/Cookies/ta-p/16348">
                            https://support.mozilla.org/t5/How-To/Cookies/ta-p/16348
                        </a>
                    </li>
                    <li>
                        Chrome –&nbsp;
                        <a href="https://support.google.com/chrome/answer/95647?hl=en&amp;ref_topic=14666">
                            https://support.google.com/chrome/answer/95647?hl=en&amp;ref_topic=14666
                        </a>
                    </li>
                    <li>
                        Safari –&nbsp;
                        <a href="https://support.apple.com/kb/PH5042?locale=en_US">
                            https://support.apple.com/kb/PH5042?locale=en_US
                        </a>
                    </li>
                    <li>
                        iOS –&nbsp;
                        <a href="https://support.apple.com/en-us/HT201265">
                            https://support.apple.com/en-us/HT201265
                        </a>
                    </li>
                    <li>
                        Brave –&nbsp;
                        <a href="https://support.brave.com/hc/en-us/articles/360018205431-How-do-I-change-site-permissions-">
                            https://support.brave.com/hc/en-us/articles/360018205431-How-do-I-change-site-permissions-
                        </a>
                    </li>
                </ul>
                <p>
                    Моля да имате предвид, че ограничаването и спирането на бисквитките, може да доведе до
                    спиране на функционалности, некоректна работа и ограничаване на потребителското Ви
                    преживяване с нашия уеб сайт.
                </p>
                <p>&nbsp;</p>
                <p>
                    <strong>ПОВЕЧЕ ИНФОРМАЦИЯ</strong>
                </p>
                <p>
                    Повече информация за това как „бисквитките“ се използват в интернет пространството може да
                    намерите тук:&nbsp;<a href="http://www.aboutcookies.org/">www.aboutcookies.org</a>.
                </p>
                <p> </p>
            </Modal.Body>
        </Modal>
    );
};

export default PrivacyPolicy;
