import React from "react";
import Modal from "react-bootstrap/Modal";

const GenTermModal = ({ show, hide }) => {
    return (
        <Modal
            show={show}
            onHide={hide}
            onEscapeKeyDown={hide}
            // dialogClassName="modal-90w"
            size="lg"
            aria-labelledby="delivery"
            scrollable
        >
            <Modal.Header closeButton>
                <Modal.Title id="delivery">Доставка и плащане</Modal.Title>
            </Modal.Header>
            <Modal.Body>
                <p>
                    <strong>ДОСТАВКА НА ПОРЪЧАНИ СТОКИ</strong>
                </p>
                <ul>
                    <li>
                        След като постъпи поръчка от Потребител, представител на mravolak.mine.bz обработва
                        тази поръчка и предава за опаковане.
                    </li>
                    <li>
                        Доставката на поръчана стока <strong>не се</strong> извършва в неделя и в официални
                        празници.
                    </li>
                    <li>
                        Обикновена доставка – в срок до 4 работни дни от момента на потвърждаването на
                        поръчката.
                    </li>
                    <li>
                        За извършване на доставки, mravolak използва услугите на куриерски фирми “ЕКОНТ
                        ЕКСПРЕС” и „СПИДИ“ като обичайните часове за доставка са в интервала от 9.00 до 17.30
                        часа.
                    </li>
                    <li>
                        Доставката на продукт&nbsp;се извършва до точно посочен от Потребителя адрес
                        (независимо дали е жилищен, или е служебен) или до офис на куриерска фирма&nbsp;“ЕКОНТ
                        ЕКСПРЕС”/ „СПИДИ“ в съответния град.
                    </li>
                    {/* <li>
                        <strong>
                            Ако желаете доставката на продукта да бъде извършена до офис на “ЕКОНТ”/ „СПИДИ“,
                            моля при набиране на заявката в графа ” Дополнителна информация ” ( Бележки към
                            поръчката ) – посочете най-удобният за Вас офис.
                        </strong>
                    </li> */}
                    <li>
                        Доставка е за сметка на клиента и се калкулира по стандартните тарифи на куриерски
                        фирми “ЕКОНТ ЕКСПРЕС” ООД и „СПИДИ“ ООД.
                    </li>
                </ul>
                <ul>
                    <li>
                        Доставка до офис на “ЕКОНТ ЕКСПРЕС” и „СПИДИ“ зависят от населеното място и поръчаните
                        продукти. Подробно за тарифа на куриерски услуги на “ЕКОНТ” и „СПИДИ“ &nbsp;може да
                        видите тук&nbsp;
                        <a href="http://www.econt.com/tariff-parcel/">
                            http://www.econt.com/tariff-parcel/#additional
                        </a>
                        &nbsp; и тук&nbsp;
                        <a href="https://services.speedy.bg/priceList/">
                            https://services.speedy.bg/priceList/
                        </a>
                    </li>
                </ul>
                <ul>
                    <li>
                        Ако Потребителят не осигури достъп и условия за предаване на стоката на посочения
                        адрес в посочения срок или не отиде до посочения офис на куриерска фирма
                        “Еконт”/“СПИДИ“, така че да&nbsp;получи в срок стоката, ако е избрал тази опция,
                        Продавачът се освобождава от задължението да изпълни заявената доставка.
                    </li>
                    <li>
                        В случаите когато не вземете поръчката си в рамките на 7 дни от куриер , всеки следващ
                        ден се таксува престой от 4.80 лв. с (ДДС) според тарифа на куриерската фирма.
                    </li>
                    <li>
                        <strong>
                            При отказ на вече изпратена поръчка Вие дължите доставките на куриерската фирма в
                            двете посоки.
                        </strong>
                    </li>
                    <li>
                        Запазваме си правото при непредвидени обстоятелства да доставим Вашите продукти в
                        различен срок от опоменатия поради причини , за които ще бъдете информирани
                        своевременно.
                    </li>
                </ul>
                <p>
                    <strong>ПЛАЩАНЕ</strong>
                </p>
                <p>
                    Заплащането на поръчаната стока се извършва чрез “наложен платеж” – плащане в брой на
                    куриерската фира “Еконт”/“Спиди“ при доставката. Доставката е за сметка на клиента и се
                    таксува според стандартните тарифи на куриерската фирма. При заплащане в брой при
                    доставката се използва&nbsp;<strong>Пощенски паричен превод.</strong> Вие ще получите
                    фиксален документ от Еконт/Спиди (лицерзиран пощенски оператор за извършване на Пощенски
                    парични преводи по смисъла на Закона за пощенски услуги). Запазете фиксалният документ,
                    който замества касов бон в доказателство за извършено плащане.&nbsp;
                </p>
                <p>
                    <strong>Благодарим Ви , че сте наши клиенти!</strong>
                </p>
            </Modal.Body>
        </Modal>
    );
};

export default GenTermModal;
